Create Method
Overload List
Name | Description
Create(Document, String, ICollectionElementId)
 Creates a new ParameterFilterElement in the given document.
Create(Document, String, ICollectionElementId, ElementFilter)
 Creates a new ParameterFilterElement in the given document.
See Also
ParameterFilterElement Class
ParameterFilterElement Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →